Author: Yinying Huo
Date: 2025-04-03
Purpose: This notebook is to merge the data from 3 separate csv files into one csv file.

In [ ]:
import pandas as pd

In [25]:
users = pd.read_csv('/Users/v_as/Documents/McMaster/Two-tower-recommender-system/data/raw/Users.csv')
books = pd.read_csv('/Users/v_as/Documents/McMaster/Two-tower-recommender-system/data/raw/Books.csv')
ratings = pd.read_csv('/Users/v_as/Documents/McMaster/Two-tower-recommender-system/data/raw/Ratings.csv')

/var/folders/dn/5wpcb4z97qg0sbkfc5r3tgsr0000gn/T/ipykernel_21928/3270308095.py:2: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books = pd.read_csv('/Users/v_as/Documents/McMaster/Two-tower-recommender-system/data/raw/Books.csv')

In [26]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271358 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271357 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

In [27]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   User-ID   278858 non-null  int64
 1   Location  278858 non-null  object
 2   Age       168096 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.4+ MB

In [28]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  int64
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  int64
dtypes: int64(2), object(1)
memory usage: 26.3+ MB

In [29]:
users[['City', 'State', 'Country']] = users['Location'].str.split(',', expand = True)[[0,1,2]]

In [30]:
users.head()

,User-ID,Location,Age,City,State,Country
0,1,"nyc, new york, usa",NaN,nyc,new york,usa
1,2,"stockton, california, usa",18.0,stockton,california,usa
2,3,"moscow, yukon territory, russia",NaN,moscow,yukon territory,russia
3,4,"porto, v.n.gaia, portugal",17.0,porto,v.n.gaia,portugal
4,5,"farnborough, hants, united kingdom",NaN,farnborough,hants,united kingdom

In [31]:
books = books.drop_duplicates('Book-Title')
ratings_with_name = ratings.merge(books, on='ISBN')

In [32]:
ratings_with_name.drop(['ISBN', 'Image-URL-S', 'Image-URL-M', 'Image-URL-L'], axis = 1, inplace = True)

ratings_with_name.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,276725,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
1,276729,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press
2,276729,6,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001,Cambridge University Press
3,276746,0,Lightning,Dean R. Koontz,1996,Berkley Publishing Group
4,276746,0,Manhattan Hunt Club,JOHN SAUL,2002,Ballantine Books

In [33]:
users_ratings_matrix = ratings_with_name.merge(users, on='User-ID')
users_ratings_matrix.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Location,Age,City,State,Country
0,276725,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,"tyler, texas, usa",NaN,tyler,texas,usa
1,276729,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,"rijeka, n/a, croatia",16.0,rijeka,n/a,croatia
2,276729,6,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001,Cambridge University Press,"rijeka, n/a, croatia",16.0,rijeka,n/a,croatia
3,276746,0,Lightning,Dean R. Koontz,1996,Berkley Publishing Group,"fort worth, ,",NaN,fort worth,,
4,276746,0,Manhattan Hunt Club,JOHN SAUL,2002,Ballantine Books,"fort worth, ,",NaN,fort worth,,

In [34]:
users_ratings_matrix.drop(['Location','City'], axis = 1, inplace = True)

In [35]:
users_ratings_matrix.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Age,State,Country
0,276725,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,NaN,texas,usa
1,276729,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,16.0,n/a,croatia
2,276729,6,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001,Cambridge University Press,16.0,n/a,croatia
3,276746,0,Lightning,Dean R. Koontz,1996,Berkley Publishing Group,NaN,,
4,276746,0,Manhattan Hunt Club,JOHN SAUL,2002,Ballantine Books,NaN,,

In [36]:
users_ratings_matrix.dropna(inplace = True)

In [37]:
users_ratings_matrix.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Age,State,Country
1,276729,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,16.0,n/a,croatia
2,276729,6,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001,Cambridge University Press,16.0,n/a,croatia
9,276747,9,Little Altars Everywhere,Rebecca Wells,2003,HarperTorch,25.0,iowa,usa
10,276747,9,Waiting to Exhale,Terry McMillan,1995,Pocket,25.0,iowa,usa
11,276747,8,Birdsong: A Novel of Love and War,Sebastian Faulks,1997,Vintage Books USA,25.0,iowa,usa

In [40]:
users_ratings_matrix.shape

(646930, 9)

In [42]:
users_ratings_matrix.info()

<class 'pandas.core.frame.DataFrame'>
Index: 646930 entries, 1 to 883078
Data columns (total 9 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   User-ID              646930 non-null  int64
 1   Book-Rating          646930 non-null  int64
 2   Book-Title           646930 non-null  object
 3   Book-Author          646930 non-null  object
 4   Year-Of-Publication  646930 non-null  object
 5   Publisher            646930 non-null  object
 6   Age                  646930 non-null  float64
 7   State                646930 non-null  object
 8   Country              646930 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 49.4+ MB

In [43]:
users_ratings_matrix.to_csv('/Users/v_as/Documents/McMaster/Two-tower-recommender-system/data/processed/users_ratings.csv', index = False)

In [61]:
# find the number of book which have only one or two ratings
print(users_ratings_matrix[users_ratings_matrix['Book-Rating'] <= 1]['Book-Title'].nunique())
# print total number of book
print(users_ratings_matrix['Book-Title'].nunique())
# find the number of user who have rated only one or two books
print(users_ratings_matrix[users_ratings_matrix['Book-Rating'] <= 1]['User-ID'].nunique())
print(users_ratings_matrix['User-ID'].nunique())

151371
203858
29860
49695